# ----------------------------------------------------------
# 지역변수 & 전역변수
# ----------------------------------------------------------

def foo():
    # global x
    x=20
    print(x)  # 전역변수 사용하되 x=20으로 바꿈
    print(f'LOCALS : {locals()}')

# 전역변수 ---------------------------------------------------------
x = 10

# 함수 호출 --------------------------------------------------------
foo()
print(x) # 전역변수 x=10에서 x=20으로 바뀐 내용 사용


print(f'GLOBAL :{globals()}')
# 맨 뒤에 'foo': <function foo at 0x100d52160>, 'x': 20 나옴